app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(params_path)
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "History"], ["room_number", 101]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(params_path)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", nil], ["room_number", nil], ["id", 1]]