app/controllers/students_controller.rb

    def create
      @student = Student.create(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Erin"], ["last_name", "Schallmoser"], ["created_at", "2020-09-01 21:13:10.042164"], ["updated_at", "2020-09-01 21:13:10.042164"]]

    def update
        @student = Student.find(params[:id])
        @student.update(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Hud"], ["updated_at", "2020-09-11 10:24:16.744035"], ["id", 1]]